---
type: IIFCEntityTreeUIServer
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IIFCEntityTreeUIServer

`Autodesk.Revit.UI.IIFCEntityTreeUIServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ShowDialog | 2023 | `bool ShowDialog ( IFCExternalServiceUIData data )` |